# In-Builts function/Operations
# > df.head()
# > df.tail()
# > df.shape
# > df.size
# > df.columns
# > df.dtypes
# > df.values
# >df.index

In [7]:
# it highlight top two rows
df.head(2)

   std_id   name  age  marks
0       1  radha   22     76
1       2   rani   32     78

In [8]:
# it highlight last two rows
df.tail(2)

   std_id    name  age  marks
3       4  shejal   43     87
4       5   priti   34     89

In [9]:
# it mention no. of rows and no. of columns
df.shape

(5, 4)

In [11]:
# it shows age columns
df.age

0    22
1    32
2    23
3    43
4    34
Name: age, dtype: int64

In [12]:
# no.of columns values*no.of rows values 
df.size

20

In [13]:
df.values

array([[1, 'radha', 22, 76],
       [2, 'rani', 32, 78],
       [3, 'shital', 23, 89],
       [4, 'shejal', 43, 87],
       [5, 'priti', 34, 89]], dtype=object)

In [15]:
df.dtypes

std_id     int64
name      object
age        int64
marks      int64
dtype: object

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
#    Data frame Operations

In [1]:
import pandas as pd
df=pd.read_csv("student.csv")
df

   std_id    name  age  marks
0       1   radha   22     76
1       2    rani   32     78
2       3  shital   23     89
3       4  shejal   43     87
4       5   priti   34     89

In [2]:
count_name=df['name'].value_counts()
print(count_name)

name
radha     1
rani      1
shital    1
shejal    1
priti     1
Name: count, dtype: int64

In [3]:
df['age_sq']=df['age'].apply(lambda x:x**2)
print(df)

   std_id    name  age  marks  age_sq
0       1   radha   22     76     484
1       2    rani   32     78    1024
2       3  shital   23     89     529
3       4  shejal   43     87    1849
4       5   priti   34     89    1156

In [4]:
unique_marks_count=df['marks'].nunique()
print(unique_marks_count)

4

In [5]:
print(df.describe())

         std_id        age      marks       age_sq
count  5.000000   5.000000   5.000000     5.000000
mean   3.000000  30.800000  83.800000  1008.400000
std    1.581139   8.642916   6.300794   555.305592
min    1.000000  22.000000  76.000000   484.000000
25%    2.000000  23.000000  78.000000   529.000000
50%    3.000000  32.000000  87.000000  1024.000000
75%    4.000000  34.000000  89.000000  1156.000000
max    5.000000  43.000000  89.000000  1849.000000